app/controllers/bookings_controller.rb

SELECT "bookings".* FROM "bookings"
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def index
        bookings = Booking.all
        bookings = bookings.map do |booking|
            {
                id: booking.id,
                user_id: booking.user_id,
                user_first_name: booking.user.first_name,
                user_last_name: booking.user.last_name,
                user_email: booking.user.email,
                property_id: booking.property_id,
                phone_number: booking.phone_number,
                move_in_date: booking.move_in_date,
                name: booking.property.name,
                image: booking.property.image,
                location: booking.property.location,
                price: booking.property.price,
                type_of_house: booking.property.type_of_house,
                category: booking.property.category

INSERT INTO "bookings" ("phone_number", "move_in_date", "user_id", "property_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["phone_number", "0706824750"], ["move_in_date", "2023-04-28"], ["user_id", 4], ["property_id", 1], ["created_at", "2023-04-05 21:16:13.605218"], ["updated_at", "2023-04-05 21:16:13.605218"]]
---
    def create
        booking = Booking.create(booking_params)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "bookings".* FROM "bookings" WHERE "bookings"."user_id" = ?  [["user_id", 4]]
---
    def my_bookings
        users = User.find(params[:id])
        bookings = users.bookings.map do |booking|