app/controllers/properties_controller.rb

    def index
        properties = Property.all
---
SELECT "properties".* FROM "properties"

    def show
        property = Property.find(params[:id])
---
SELECT "properties".* FROM "properties" WHERE "properties"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]